/*****************************************************************************************  
 *  RaysRTOS核心文件 
 * 
 *  Copyright (C) 2010  苑臣芒 
 * 
 *  2010-07-09  RaysRTOS 核心函数
 *****************************************************************************************/
#include "RaysRTOS.h"

/*
+---------------------------------------------------------------------------------------+
|函数名称:  OSSetPrioRdy                                                                |
|---------------------------------------------------------------------------------------|
|函数原型:  void OSSetPrioRdy(prio)                                                     |
|函数功能:  任务就绪                                                                    |
|入口参数:  prio 任务优先级                                                             |
+---------------------------------------------------------------------------------------+
*/
#define OSSetPrioRdy(Prio)    \
    {                         \
    OSRdyTbl |= 0x01<<Prio;   \
    }		                                          
/*
+---------------------------------------------------------------------------------------+
|函数名称：	OSDelPrioRdy																|
|---------------------------------------------------------------------------------------|
|函数原型：	void OSDelPrioRdy(prio)														|
|																						|
|函数功能：	任务删除 															   		|
|																						|
|入口参数：	prio 任务优先级														   		|
+---------------------------------------------------------------------------------------+
*/							          
#define OSDelPrioRdy(Prio)    \
    {                         \
    OSRdyTbl &= ~(0x01<<Prio);\
	}												   
/*
+---------------------------------------------------------------------------------------+
|函数名称:  RAYS_TaskCreate                                                             |
|---------------------------------------------------------------------------------------|
|函数原型:  void RAYS_TaskCreate(void (*p_Task)(void),.......)                          |
|函数功能:  建立任务                                                                    |
|入口参数:  *Task：任务函数地址；*Stack：任务栈顶指针；Prio:任务优先级                  |
+---------------------------------------------------------------------------------------+
*/
void RAYS_TaskCreate(void (*p_Task)(void),STACK_TypeDef *p_Stack,PRIO_TypeDef Prio)
{
    if(Prio <= OS_TASKS)
    {
        CPU_TaskCreate(p_Task,p_Stack,Prio);  //具体平台任务创建函数  	
        OSSetPrioRdy(Prio);      			  // 在任务就绪表中登记	
    }
}


/*
+---------------------------------------------------------------------------------------+
|函数名称:  RAYS_Start                                                                  |
|---------------------------------------------------------------------------------------|
|函数原型:  void RAYS_Start(void)                                                       |
|函数功能:  系统启动                                                                    |
+---------------------------------------------------------------------------------------+
*/
void RAYS_Start(void)
{
    OSPrioCur = OSPrioHighRdy=0;   // 运行最高优先级任务
    CPU_OSStart();                 // 具体平台系统启动函数								
}

/*
+---------------------------------------------------------------------------------------+
|函数名称:  RAYS_TimeDelay                                                              |
|---------------------------------------------------------------------------------------|
|函数原型: 	void RAYS_TimeDelay(TICKS_TypeDef ticks)                                    |
|函数功能:  任务延时                                                                    |
|入口参数:  延时的时间，任务等待时钟节拍的个数                                          |
|有关说明:  延时数不得超出TICKS_TypeDef的范围                                           |
+---------------------------------------------------------------------------------------+
*/
void RAYS_TimeDelay(TICKS_TypeDef ticks)
{
TICKS_TypeDef i=0;
	if(ticks)                           	//如果需要延时         
	{
		OS_ENTER_CRITICAL();
		OSDelPrioRdy(OSPrioCur);			// 把任务从就绪表中删去 
		TCB[OSPrioCur].OSTCBDly = ticks;	// 设置任务延时节拍数   
		OS_EXIT_CRITICAL();
		for( i = 0;(i < OS_TASKS) && (!(OSRdyTbl & (0x01<<i)));i++ );//查找最高优先级算法
			OSPrioHighRdy = i;	
		OSSched();                          // 任务调度
	}
}

#if(TASK_SUSPEND_EN==1)	//是否启用任务挂起恢复功能
/*
+---------------------------------------------------------------------------------------+
|函数名称:  RAYS_TaskSuspend                                                            |
|---------------------------------------------------------------------------------------|
|函数原型:  void RAYS_TaskSuspend(PRIO_TypeDef Prio)                                    |
|函数功能:  任务挂起                                                                    |
|入口参数:  挂起任务的优先级                                                            |
+---------------------------------------------------------------------------------------+
*/
void RAYS_TaskSuspend(PRIO_TypeDef Prio)
{
	OS_ENTER_CRITICAL();
	TCB[Prio].OSTCBDly = 0;
	OSDelPrioRdy(Prio);				// 从任务就绪表上去除标志位
	OS_EXIT_CRITICAL();
		
	if(OSPrioCur == Prio)			// 当要挂起的任务为当前任务	
	{
		OSSched();					// 重新调度					
	}	
}

/*
+---------------------------------------------------------------------------------------+
|函数名称：	RAYS_TaskResume                                                             |
|---------------------------------------------------------------------------------------|
|函数原型:  void RAYS_TaskResume(PRIO_TypeDef Prio)                                     |
|函数功能:  任务恢复                                                                    |
|入口参数:  恢复任务的优先级                                                            |
+---------------------------------------------------------------------------------------+
*/
void RAYS_TaskResume(PRIO_TypeDef Prio)
{
	OS_ENTER_CRITICAL();
	OSSetPrioRdy(Prio);				// 从任务就绪表上重置标志位	
    TCB[Prio].OSTCBDly = 0;			// 将时间计时设为0,延时到	
	OS_EXIT_CRITICAL();
	
	if(OSPrioCur > Prio)			// 当前任务的优先级低于重置位的任务的优先级	
	{
		OSSched();					// 重新调度					
	}
	
}
#endif	 //对应 #if(TASK_SUSPEND_EN==1)
/*
+---------------------------------------------------------------------------------------+
|函数名称:  TickIntHook                                                                 |
|---------------------------------------------------------------------------------------|
|函数原型:  void TickIntHook(void)                                                      |
|函数功能:  T0中断钩子程序                                                              |
|有关说明:  用来为需要延时的任务进行计时                                                |
+---------------------------------------------------------------------------------------+
*/
 void TickIntHook(void)
	{
		INT8U i;

		for(i = 0; i < OS_TASKS; i++)			// 刷新各任务时钟 
		{
			if(TCB[i].OSTCBDly )
			{
				TCB[i].OSTCBDly --;
				if(TCB[i].OSTCBDly == 0)		// 当任务时钟到时,必须是由定时器减时的才行
				{
					OSSetPrioRdy(i);		    // 使任务可以重新运行		
				}
			}
		}
		for( i = 0;(i < OS_TASKS) && (!(OSRdyTbl & (0x01<<i)));i++ );//查找最高优先级算法
			OSPrioHighRdy = i;	
} 

/*
+---------------------------------------------------------------------------------------+
|函数名称:  IdleTask                                                                    |
|---------------------------------------------------------------------------------------|
|函数原型:  void IdleTask(void)                                                         |
|函数功能:  空闲任务                                                                    |
|有关说明:  空闲任务必须永远处于就绪状态                                                |
+---------------------------------------------------------------------------------------+
*/
void Idle_Task(void)
{	
	IdleCount = 0;
	while(1)
		IdleCount++;
}

/*
+---------------------------------------------------------------------------------------+
|函数名称:  RAYS_Init                                                                   |
|---------------------------------------------------------------------------------------|
|函数原型:  void RAYS_Init(void)                                                        |
|函数功能:  初始化系统全局变量                                                          |
+---------------------------------------------------------------------------------------+
*/
void RAYS_Init(void)
{
	OSRdyTbl = 0;
	OSPrioCur = OSPrioHighRdy = OS_TASKS;
}

